In [46]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# using Pandas to read my file

In [47]:
df = pd.read_csv("/home/tina/intermidiate_sessions/Nigerian_Car_Prices.csv")
df.head()

,Unnamed: 0,Make,Year of manufacture,Condition,Mileage,Engine Size,Fuel,Transmission,Price,Build
0,0,Toyota,2007.0,Nigerian Used,166418.0,2400.0,Petrol,Automatic,"3,120,000",NaN
1,1,Lexus,NaN,NaN,138024.0,NaN,NaN,Automatic,"5,834,000",NaN
2,2,Mercedes-Benz,2008.0,Nigerian Used,376807.0,3000.0,Petrol,Automatic,"3,640,000",NaN
3,3,Lexus,NaN,NaN,213362.0,NaN,NaN,Automatic,"3,594,000",NaN
4,4,Mercedes-Benz,NaN,NaN,106199.0,NaN,NaN,Automatic,"8,410,000",NaN

with this data here are a few questions i would be looking at using aggregates

# What is the most expensive Automatic car (show car name and model make) with a mileage of less than 50000

# Write a function to bring out the average of each car, which car make has the highest average price? Write a code to show this

# Select the row with a price at the 76th percentile score

# Question 1:  What is the most expensive Automatic car (show car name and model make) with a mileage of less than 50000

In [48]:
mileage_5000 = df[(df['Mileage'] < 5000)].head()
mileage_5000.groupby(["Make"])['Price'].max().head().reset_index()

            Make      Price
0           Fiat  8,500,000
1  Mercedes-Benz  6,760,000

# Write a function to bring out the average of each car, which car make has the highest average price? Write a code to show this

In [49]:
df.dtypes

Unnamed: 0               int64
Make                    object
Year of manufacture    float64
Condition               object
Mileage                float64
Engine Size            float64
Fuel                    object
Transmission            object
Price                   object
Build                   object
dtype: object

In [50]:
def func_treat(row):
    if "," in row:
        return int(row.replace(",",''))
    return row

In [51]:
df["Price"] = df["Price"].apply(lambda y : func_treat(y))

In [52]:
df["Price"].dtypes

dtype('int64')

In [60]:
df.groupby(["Make"])['Price'].mean().max()

4271287.728693529

In [25]:
from numpy import quantile


df.groupby(['Price']).quantile(0.76)

/tmp/ipykernel_7871/1446624986.py:4: FutureWarning: Dropping invalid columns in DataFrameGroupBy.quantile is deprecated. In a future version, a TypeError will be raised. Before calling .quantile, select only columns which should be valid for the function.
  df.groupby(['Price']).quantile(0.76)

           Unnamed: 0  Year of manufacture    Mileage  Engine Size
Price
1,006,800     2385.00                  NaN  128773.00          NaN
1,012,500     3935.12              2004.28  304521.32       3140.0
1,018,000     3409.00                  NaN  215674.00          NaN
1,018,500     3429.00              2006.00  202078.00       3000.0
1,025,000     2386.84              2006.00  180952.00       1900.0
...               ...                  ...        ...          ...
950,000       3214.00              2003.00  258793.00       2400.0
956,250       3630.00              2003.00        NaN       3000.0
962,000       3859.24                  NaN  248398.64          NaN
988,000       3889.00              1999.00  143938.00       2300.0
997,500       3810.60              2004.00  341184.40       3000.0

[579 rows x 4 columns]